app/controllers/groups_controller.rb

	def new
		@group = Group.new
		@faculty = Faculty.find(params[:faculty_id])
---
SELECT `faculties`.* FROM `faculties` WHERE `faculties`.`id` = 1 LIMIT 1

    def create
    	@group = Group.new(group_params)

        if @group.save
---
INSERT INTO `groups` (`cource`, `created_at`, `faculty_id`, `name`, `updated_at`) VALUES (4, '2014-10-06 20:28:21', 1, 'aaa', '2014-10-06 20:28:21')

	def edit
	    @group = Group.find(params[:id])
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 3 LIMIT 1

	def update
	    @group = Group.find(params[:id])

	    if @group.update(group_params)
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 3 LIMIT 1
UPDATE `groups` SET `name` = 'aaa', `updated_at` = '2014-10-06 20:42:02' WHERE `groups`.`id` = 5

    def show
        @group = Group.find(params[:id])
	  	@faculty = Faculty.find(@group.faculty_id)
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
SELECT `faculties`.* FROM `faculties` WHERE `faculties`.`id` = 1 LIMIT 1

	def destroy
	  	@group = Group.find(params[:id])
	  	@faculty = Faculty.find(@group.faculty_id)
	  	@group.destroy
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 2 LIMIT 1
SELECT `faculties`.* FROM `faculties` WHERE `faculties`.`id` = 1 LIMIT 1
DELETE FROM `groups` WHERE `groups`.`id` = 2