app/controllers/search_controller.rb

SELECT `groups`.* FROM `groups` WHERE (name LIKE '%aa%')
---
	def by_group_result
	  if params[:search] && params[:search] != nil && params[:search] != ""
          @groups = Group.search(params[:search])